In [2]:
import pandas as pd

data = {'Name': ["John", "Anna", "Petter", "Linda"], 'Location': ["New York", "Paris", "Berlin", "London"], 'Age': [24, 13, 53, 33]}
data_pandas = pd.DataFrame(data)

display(data_pandas)

     Name  Location  Age
0    John  New York   24
1    Anna     Paris   13
2  Petter    Berlin   53
3   Linda    London   33

In [3]:
s = pd.Series([1, 2, 3])
s[2]

np.int64(3)

In [4]:
data = {
    'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012], 
    'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 'RMadrid', 'Rmadrid', 'ValenciaCF', 'ValenciaCF', 'ValenciaCF'],
    'wins': [30, 28, 32, 29, 32, 26, 21, 17, 19],
    'draws': [6, 7, 4, 5, 4, 7, 8, 10, 8],
    'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]
}

football = pd.DataFrame(data, columns = [ 'year', 'team', 'wins', 'draws', 'losses' ])

football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      Rmadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11